dewayne57/PIC18F__Q43/Libraries/HD44780/hd44780.c
/* *****************************************************************************************
 *   File Name: hd44780.c
 *   Description: Source file for HD44780 LCD interface functions.
 *   Author: Dewayne Hafenstein
 *   Date: 2026-06-04
 *
 *   Copyright (c) 2026, Dewayne Hafenstein.
 *   Licensed under the Apache License, Version 2.0 (the "License");
 *   you may not use this file except in compliance with the License.
 *   You may obtain a copy of the License at
 *
 *       http://www.apache.org/licenses/LICENSE-2.0
 *
 *   Unless required by applicable law or agreed to in writing, software
 *   distributed under the License is distributed on an "AS IS" BASIS,
 *   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *   See the License for the specific language governing permissions and
 *   limitations under the License.
 ***************************************************************************************** */

#include <xc.h>
#include <stdbool.h>
#include <stdio.h>
#include "string.h"
#include "stdarg.h"
#include "config.h"
#include "hd44780.h"

#define LCD_PRINTF_FALLBACK_BUFFER_SIZE 64U

/// @brief  Check if the LCD has been initialized by checking the initialized flag in
/// the lcd_handle_t structure. This function can be used at the beginning of each LCD
/// function to ensure that the LCD has been initialized before attempting to send
/// commands or data. If the LCD has not been initialized, the function will return
/// false. If the LCD has been initialized, it will return true. This helps prevent errors
/// caused by calling LCD functions before initialization, and it also allows the LCD
/// functions to be more robust and self-contained by handling the initialization check
/// internally.
/// @param  lcd Pointer to the lcd_handle_t structure that contains the configuration for the LCD
/// interface. This structure must be properly initialized with the correct interface mode,
/// number of rows and columns, data port and control pin configurations, and a buffer for
/// storing the current display contents. The function will check the initialized flag in this
/// structure to determine if the LCD has been initialized.
/// @return true if the LCD has been initialized, false if it has not been initialized
static bool checkIfInitialized(lcd_handle_t *lcd)
{
    if (lcd == NULL)
    {
        return false;
    }
    if (!lcd->initialized)
    {
        return false; // LCD is not initialized, return false
    }
    return true; // LCD is initialized, return true
}

/// @brief  Check if the given lcd_pin_t structure represents a valid pin configuration.
/// A valid pin configuration must have non-NULL pointers for the lat, port, and tris
/// registers, and the bit field must be between 0 and 7 (inclusive). This function can
/// be used to validate the pin configurations in the lcd_handle_t structure before
/// attempting to use them to control the LCD. If any of the required pins are invalid,
/// the LCD functions can return an error or take appropriate action to prevent undefined
/// behavior.
/// @param  pin Pointer to the lcd_pin_t structure that represents a single LCD pin
/// configuration.
/// @return true if the pin configuration is valid, false if it is invalid
static bool isPinValid(const lcd_pin_t *pin)
{
    return (pin != NULL) && (pin->lat != NULL) && (pin->port != NULL) && (pin->tris != NULL) && (pin->bit < 8U);
}

/// @brief  Write a logic level to the specified LCD pin. This function will set the output
/// state of the pin based on the level parameter. The function will first validate the pin
/// configuration using the isPinValid function, and if the pin is valid, it will write the
/// specified level to the pin's lat register. If the level is true, the function will
/// set the corresponding bit in the lat register; if the level is false, it will clear the
/// corresponding bit. This function abstracts the low-level details of controlling the LCD pins
/// and provides a simple interface for setting the state of the control and data pins.
/// @param  pin Pointer to the lcd_pin_t structure that represents the LCD pin to write to.
/// @param  level The logic level to write to the pin (true for high, false for low)
/// @return None
static void pinWrite(const lcd_pin_t *pin, bool level)
{
    uint8_t mask;

    if (!isPinValid(pin))
    {
        return;
    }
    mask = (uint8_t)(1U << pin->bit);
    if (level)
    {
        *(pin->lat) |= mask;
    }
    else
    {
        *(pin->lat) &= (uint8_t)(~mask);
    }
}

/// @brief  Read the logic level from the specified LCD pin. This function will return the
/// current state of the pin based on the value in the port register. The function will first
/// validate the pin configuration using the isPinValid function, and if the pin is valid, it
/// will read the state of the pin from the port register. If the pin is high, the function
/// will return true; if the pin is low, the function will return false. This function
/// abstracts the low-level details of reading the LCD pins and provides a simple interface
/// for getting the state of the control and data pins.
/// @param  pin Pointer to the lcd_pin_t structure that represents the LCD pin to read from.
/// @return true if the pin is high, false if the pin is low
static bool pinRead(const lcd_pin_t *pin)
{
    uint8_t mask;

    if (!isPinValid(pin))
    {
        return false;
    }
    mask = (uint8_t)(1U << pin->bit);
    return ((*(pin->port) & mask) != 0U);
}

/// @brief  Set the direction of the specified LCD pin. This function will configure the pin
/// as an input or output based on the input parameter. The function will first validate the
/// pin configuration using the isPinValid function, and if the pin is valid, it will set
/// the direction of the pin by modifying the tris register. If the input parameter is true,
/// the pin will be configured as an input; if the input parameter is false, the pin will be
/// configured as an output.
/// @param  pin Pointer to the lcd_pin_t structure that represents the LCD pin to configure.
/// @param  input true to configure the pin as an input, false to configure it as an output.
/// @return None
static void pinSetInput(const lcd_pin_t *pin, bool input)
{
    uint8_t mask;

    if (!isPinValid(pin))
    {
        return;
    }
    mask = (uint8_t)(1U << pin->bit);
    if (input)
    {
        *(pin->tris) |= mask;
    }
    else
    {
        *(pin->tris) &= (uint8_t)(~mask);
    }
}

/// @brief  Check if the lcd_handle_t structure has all the required pins configured for
/// the specified interface mode. This function will validate that the rs, rw, and e
/// control pins are valid, as well as the data pins required for the selected interface mode.
/// @param lcd Pointer to the lcd_handle_t structure to check.
/// @return true if all required pins are valid, false otherwise.
static bool hasRequiredPins(const lcd_handle_t *lcd)
{
    uint8_t i;
    uint8_t start;

