dewayne57/PIC18F__Q43/Libraries/HD44780/hd44780.c
    if ((lcd == NULL) || !isPinValid(&lcd->rs) || !isPinValid(&lcd->rw) || !isPinValid(&lcd->e))
    {
        return false;
    }

    start = (lcd->interface_mode == LCD_INTERFACE_8_BIT) ? 0U : 4U;
    for (i = start; i < 8U; i++)
    {
        if (!isPinValid(&lcd->data[i]))
        {
            return false;
        }
    }

    return true;
}

/// @brief  Set the direction of the data pins based on the interface mode. This function will
/// configure the data pins as inputs or outputs based on the input parameter. The function will
/// determine which data pins to configure based on the interface mode (8-bit or 4-bit) and will
/// call the pinSetInput function for each data pin to set the direction accordingly.
/// @param lcd Pointer to the lcd_handle_t structure that contains the LCD pin mapping.
/// @param input true to configure the data pins as inputs, false to configure them as outputs.
/// @return None
static void setDataDirection(lcd_handle_t *lcd, bool input)
{
    uint8_t i;
    uint8_t start = (lcd->interface_mode == LCD_INTERFACE_8_BIT) ? 0U : 4U;
    for (i = start; i < 8U; i++)
    {
        pinSetInput(&lcd->data[i], input);
    }
}

/// @brief  Write an 8-bit value to the LCD data bus. This function will write the specified
/// value to the data pins D0..D7 based on the interface mode. In 8-bit mode, all 8 data pins
/// will be used; in 4-bit mode, only the high nibble (D4..D7) will be used.
/// @param lcd Pointer to the lcd_handle_t structure that contains the LCD pin mapping.
/// @param value The 8-bit value to write to the data bus.
/// @return None
static void writeDataBus8(lcd_handle_t *lcd, uint8_t value)
{
    uint8_t i;
    for (i = 0; i < 8U; i++)
    {
        pinWrite(&lcd->data[i], ((value & (uint8_t)(1U << i)) != 0U));
    }
}

/// @brief  Write a 4-bit nibble to the LCD data bus. This function will write the specified
/// nibble to the high data pins D4..D7 based on the interface mode.
/// @param lcd Pointer to the lcd_handle_t structure that contains the LCD pin mapping.
/// @param nibble The 4-bit nibble to write to the data bus (should be in the lower 4 bits
/// of the byte).
/// @return None
static void writeNibble4(lcd_handle_t *lcd, uint8_t nibble)
{
    uint8_t i;
    for (i = 0; i < 4U; i++)
    {
        pinWrite(&lcd->data[i + 4U], ((nibble & (uint8_t)(1U << i)) != 0U));
    }
}

/// @brief  Pulse the enable pin to latch data into the LCD.
/// @param lcd Pointer to the lcd_handle_t structure that contains the LCD pin mapping.
/// @return None
static void pulseEnable(lcd_handle_t *lcd)
{
    pinWrite(&lcd->e, true);
    __delay_us(1);
    pinWrite(&lcd->e, false);
    __delay_us(1);
}

/// @brief This function reads the busy flag and returns true if the LCD is busy,
/// or false if it is ready to accept the next command or data byte.
/// @param  lcd Pointer to the lcd_handle_t structure that contains the LCD pin mapping.
/// @return true if the LCD is busy, false if it is ready for the next command or data byte
LCD_WEAK bool LCD_ReadBusyFlag(lcd_handle_t *lcd)
{
    bool busy;

    if ((lcd == NULL) || !hasRequiredPins(lcd))
    {
        return false;
    }

    setDataDirection(lcd, true); // Configure data pins as inputs
    pinWrite(&lcd->rs, false);   // Set RS low for command mode
    pinWrite(&lcd->rw, true);    // Set RW to read mode

    if (lcd->interface_mode == LCD_INTERFACE_8_BIT)
    {
        pinWrite(&lcd->e, true);
        __delay_us(1);
        busy = pinRead(&lcd->data[7]);
        pinWrite(&lcd->e, false);
    }
    else
    {
        pinWrite(&lcd->e, true);
        __delay_us(1);
        busy = pinRead(&lcd->data[7]); // Busy bit is D7 in the high nibble
        pinWrite(&lcd->e, false);

        // Read and discard low nibble to complete the 4-bit read cycle.
        pinWrite(&lcd->e, true);
        __delay_us(1);
        pinWrite(&lcd->e, false);
    }

    pinWrite(&lcd->rw, false);    // Set RW back to write mode
    setDataDirection(lcd, false); // Restore data pins as outputs
    return busy;
}

/// @brief  Send a command to the LCD.
/// @param  lcd Pointer to the lcd_handle_t structure that contains the configuration for
/// the LCD interface. This structure must be properly initialized with the correct interface
/// mode, number of rows and columns, data port and control pin configurations, and a buffer
/// for storing the current display contents. The function will use this information to send
/// the command byte to the LCD and update the display buffer accordingly.
/// @param  cmd  The command byte to send to the LCD
/// @return None
LCD_WEAK void LCD_SendCommand(lcd_handle_t *lcd, uint8_t cmd)
{
    if ((lcd == NULL) || !hasRequiredPins(lcd))
    {
        return;
    }

    if (lcd->initialized)
    {
        while (LCD_ReadBusyFlag(lcd))
            ; // Wait until LCD is not busy
    }

    pinWrite(&lcd->rs, false); // Set RS low for command mode
    pinWrite(&lcd->rw, false); // Set RW low for write mode

    if (lcd->interface_mode == LCD_INTERFACE_8_BIT)
    {
        writeDataBus8(lcd, cmd);
        pulseEnable(lcd);
    }
    else
    {
        writeNibble4(lcd, (uint8_t)(cmd >> 4));
        pulseEnable(lcd);
        writeNibble4(lcd, (uint8_t)(cmd & 0x0FU));
        pulseEnable(lcd);
    }
}

/// @brief  Send a data byte to the LCD.
/// @param  lcd Pointer to the lcd_handle_t structure that contains the configuration
/// for the LCD interface. This structure must be properly initialized with the correct
/// interface mode, number of rows and columns, data port and control pin configurations,
/// and a buffer for storing the current display contents. The function will use this
/// information to send the data byte to the LCD and update the display buffer accordingly.
/// @param  data  The data byte to send to the LCD
/// @return None
LCD_WEAK void LCD_SendData(lcd_handle_t *lcd, uint8_t data)
{
    if ((lcd == NULL) || !hasRequiredPins(lcd))
    {
        return;
    }

    if (lcd->initialized)
    {
        while (LCD_ReadBusyFlag(lcd))
            ; // Wait until LCD is not busy
    }

