dewayne57/PIC18F__Q43/Libraries/HD44780/hd44780.c
    pinWrite(&lcd->rs, true);  // Set RS high for data mode
    pinWrite(&lcd->rw, false); // Set RW low for write mode

    if (lcd->interface_mode == LCD_INTERFACE_8_BIT)
    {
        writeDataBus8(lcd, data);
        pulseEnable(lcd);
    }
    else
    {
        writeNibble4(lcd, (uint8_t)(data >> 4));
        pulseEnable(lcd);
        writeNibble4(lcd, (uint8_t)(data & 0x0FU));
        pulseEnable(lcd);
    }
}

/// @brief  Control the LCD backlight. The backlight is connected to RB2, which is
/// configured as a digital output.  This output pin drives a transistor that controls
/// power to the LCD backlight, so setting the pin high turns on the backlight and
/// setting it low turns it off.
/// @param state  true to turn on the backlight, false to turn it off
LCD_WEAK void LCD_BackLight(lcd_handle_t *lcd, bool state)
{
    if ((lcd == NULL) || !isPinValid(&lcd->backlight))
    {
        return;
    }
    pinWrite(&lcd->backlight, state);
}

/// @brief  Initialize the LCD display. This function must be called before any other LCD functions are used.
/// @param  lcd Pointer to the lcd_handle_t structure that contains the configuration for the LCD
/// interface. This structure must be properly initialized with the correct interface mode, number
/// of rows and columns, data port and control pin configurations, and a buffer for storing the
/// current display contents. The function will use this information to initialize the LCD and
/// prepare it for use.
/// @return True if the LCD was successfully initialized, or false if there was an error during
/// initialization (e.g. invalid configuration parameters).
bool LCD_Init(lcd_handle_t *lcd)
{
    uint8_t i;
    uint8_t function_set;

    if ((lcd == NULL) || !hasRequiredPins(lcd))
    {
        return false;
    }

    // Check if the LCD has already been initialized to prevent re-initialization
    if (checkIfInitialized(lcd))
    {
        return true; // LCD is already initialized, return success
    }

    // First, calculate the DDRAM addresses for the start of each line based on the number of columns and rows.
    // This allows the LCD_SetCursor function to set the correct DDRAM address based on the row and column.
    if (lcd->num_rows < 1 || lcd->num_rows > 4 || lcd->num_cols < 1 || lcd->num_cols > 40)
    {
        return false; // Invalid configuration parameters
    }
    lcd->line_addresses[0] = LCD_LINE_1_ADDR;
    lcd->line_addresses[1] = LCD_LINE_2_ADDR;
    lcd->line_addresses[2] = LCD_LINE_3_ADDR;
    lcd->line_addresses[3] = LCD_LINE_4_ADDR;

    // Configure data and control pins as outputs.
    setDataDirection(lcd, false);
    pinSetInput(&lcd->rs, false);
    pinSetInput(&lcd->rw, false);
    pinSetInput(&lcd->e, false);
    pinWrite(&lcd->rs, false);
    pinWrite(&lcd->rw, false);
    pinWrite(&lcd->e, false);

    if (isPinValid(&lcd->backlight))
    {
        pinSetInput(&lcd->backlight, false);
        pinWrite(&lcd->backlight, false);
    }

    lcd->initialized = false;
    __delay_ms(20);

    if (lcd->interface_mode == LCD_INTERFACE_8_BIT)
    {
        for (i = 0; i < 3U; i++)
        {
            writeDataBus8(lcd, 0x30);
            pulseEnable(lcd);
            __delay_ms(5);
        }
    }
    else
    {
        for (i = 0; i < 3U; i++)
        {
            writeNibble4(lcd, 0x03);
            pulseEnable(lcd);
            __delay_ms(5);
        }
        writeNibble4(lcd, 0x02);
        pulseEnable(lcd);
        __delay_ms(1);
    }

    function_set = LCD_CMD_FUNCTION_SET;
    if (lcd->interface_mode == LCD_INTERFACE_8_BIT)
    {
        function_set |= LCD_8_BIT_MODE;
    }
    if (lcd->num_rows > 1U)
    {
        function_set |= LCD_2_LINE;
    }

    LCD_SendCommand(lcd, function_set);
    lcd->initialized = true;

    // Display control: display on, cursor on, blink off
    LCD_SendCommand(lcd, LCD_CMD_DISPLAY_CONTROL | LCD_DISPLAY_ON | LCD_CURSOR_ON);

    // Clear display
    LCD_Clear(lcd);

    // Entry mode set: increment cursor, no display shift
    LCD_SendCommand(lcd, LCD_CMD_ENTRY_MODE_SET | LCD_ENTRY_MODE_INCREMENT);

    return true;
}

/// @brief  Clear all characters on the specified line by writing spaces to
/// every position on the line.  Leaves the cursor at the beginning of the line
/// after clearing. This is a helper function that simplifies clearing a specific line.
/// @param line The 1-based index of the line to clear (1 for first line, 2 for
/// second line, etc.). If an invalid line number is passed, the function does nothing.
void LCD_ClearLine(lcd_handle_t *lcd, uint8_t line)
{
    if (!checkIfInitialized(lcd))
    {
        return; // LCD is not initialized, do nothing
    }

    if (line < 1 || line > lcd->num_rows)
    {
        return; // Invalid line number, do nothing
    }
    for (uint8_t i = 1; i <= lcd->num_cols; i++)
    {
        LCD_PrintAt(lcd, line, i, " "); // Write a space character to clear each position on the line
    }
    LCD_SetCursor(lcd, line, 1);
}

/// @brief  Clear the LCD display and return the cursor to the home
/// position (0,0).
/// @param  None
/// @return None
void LCD_Clear(lcd_handle_t *lcd)
{
    if (!checkIfInitialized(lcd))
    {
        while (1)
            ; // LCD is not initialized, enter infinite loop to prevent further execution
    }
    LCD_SendCommand(lcd, LCD_CMD_CLEAR_DISPLAY);
    __delay_ms(2); // Clear command takes longer time to execute
}

/// @brief  Set the cursor position on the LCD.   The HD44780 controller
/// is defined for 1 or 2 rows of display data, and maps the memory addresses
/// accordingly.  However, if the display has more than 2 lines, the additional
/// lines are typically mapped to the memory addresses in excess of the first 2
/// lines.  For example, on a 20x4 LCD, the first line is mapped to addresses
/// 0x00-0x13, the second line is mapped to addresses 0x40-0x53, the third line
/// is mapped to addresses 0x14-0x27, and the fourth line is mapped to addresses
/// 0x54-0x67.  This causes some confusion on the display when setting the cursor
/// position via the HD44780 command code.  So, what this function does instead
/// is take a row and column number as arguments, and then it calculates the
/// correct DDRAM address based on the row and column, and sends the appropriate
/// command to set the DDRAM address.  This allows the caller to simply specify
/// the row and column they want to move the cursor to, without having to worry
/// about how the LCD maps its memory addresses to the display lines.
/// @param  lcd Pointer to the lcd_handle_t structure that contains the configuration
/// for the LCD interface. This structure must be properly initialized with the
/// correct interface mode, number of rows and columns, data port and control
/// pin configurations, and a buffer for storing the current display contents.
/// The function will use this information to calculate the correct DDRAM address
/// based on the specified row and column, and then send the appropriate command
/// to set the cursor position on the LCD.
/// @param  row  The row number (1-based index, 1-4 for a 4-line display)
/// @param  col  The column number (1-based index, 1-20 for a 20-column display)
/// @return None
void LCD_SetCursor(lcd_handle_t *lcd, uint8_t row, uint8_t col)
{
    if (row < 1 || row > lcd->num_rows || col < 1 || col > lcd->num_cols)
    {
        return; // Invalid row or column, do nothing
    }
    // Calculate DDRAM address based on row and column
    uint8_t address = lcd->line_addresses[row - 1] + (col - 1);
    LCD_SendCommand(lcd, LCD_CMD_SET_DDRAM_ADDR | address);
}

/// @brief  Print a string on the LCD. The string will be printed
/// starting at the current cursor position. The cursor will
/// automatically move to the right after each character is printed.
/// @param lcd Pointer to the lcd_handle_t structure that contains the configuration
/// for the LCD interface. This structure must be properly initialized with the
/// correct interface mode, number of rows and columns, data port and control pin
/// configurations, and a buffer for storing the current display contents. The
/// function will use this information to send each character of the string to the
/// LCD as data, and it will also update the display buffer accordingly. The
/// function will continue to print characters until the end of the string is reached.
/// @param str  The string to print
/// @return None
void LCD_Print(lcd_handle_t *lcd, const char *str)
{
    while (*str)
    {
        LCD_SendData(lcd, (uint8_t)(*str)); // Send each character as data
        str++;                              // Move to the next character in the string
    }
}

