dewayne57/PIC18F__Q43/Libraries/HD44780/hd44780.c
/// @brief  Print a formatted string on the LCD. This function takes a
/// format string and additional arguments, formats the string using
/// vsnprintf, and then prints it on the LCD.
/// @param lcd Pointer to the lcd_handle_t structure that contains the configuration
/// for the LCD interface. This structure must be properly initialized with the
/// correct interface mode, number of rows and columns, data port and control pin
/// configurations, and a buffer for storing the current display contents. The
/// function will use this information to send each character of the string to the
/// LCD as data, and it will also update the display buffer accordingly. The
/// function will continue to print characters until the end of the string is reached.
/// @param format The format string
/// @param ... Additional arguments for the format string
/// @return None
void LCD_Printf(lcd_handle_t *lcd, const char *format, ...)
{
    char temp[LCD_PRINTF_FALLBACK_BUFFER_SIZE];
    char *dst;
    size_t dst_size;

    if (!checkIfInitialized(lcd))
    {
        return;
    }

    if ((lcd->buffer != NULL) && (lcd->buffer_size > 0U))
    {
        dst = (char *)lcd->buffer;
        dst_size = lcd->buffer_size;
    }
    else
    {
        dst = temp;
        dst_size = sizeof(temp);
    }

    va_list args;
    va_start(args, format);
    (void)vsnprintf(dst, dst_size, format, args);
    va_end(args);
    LCD_Print(lcd, dst); // Print the formatted string on the LCD
}

/// @brief  Print a string on the LCD at a specified position. This function
/// moves the cursor to the specified row and column, and then prints the
/// string starting from that position. The cursor will automatically move
/// to the right after each character is printed, and if the string exceeds
/// the end of the line, it will wrap to the next line. This function is a
/// convenient way to print text at a specific location on the display without
/// having to manually set the cursor position before calling LCD_Print().
/// @param lcd Pointer to the lcd_handle_t structure that contains the configuration
/// for the LCD interface. This structure must be properly initialized with the
/// correct interface mode, number of rows and columns, data port and control pin
/// configurations, and a buffer for storing the current display contents. The
/// function will use this information to send each character of the string to the
/// LCD as data, and it will also update the display buffer accordingly. The
/// function will continue to print characters until the end of the string is reached.
/// @param row The row number (1-based) where the string should start
/// @param col The column number (1-based) where the string should start
/// @param str The string to print
void LCD_PrintAt(lcd_handle_t *lcd, uint8_t row, uint8_t col, const char *str)
{
    LCD_SetCursor(lcd, row, col); // Move cursor to the specified position
    LCD_Print(lcd, str);          // Print the string at the specified position
}

/// @brief  Print a formatted string on the LCD at a specified position. This
/// function moves the cursor to the specified row and column, formats the string
/// using vsnprintf, and then prints it on the LCD. The cursor will automatically
/// move to the right after each character is printed, and if the string exceeds
/// the end of the line, it will wrap to the next line. This function is a
/// convenient way to print formatted text at a specific location on the display
/// without having to manually set the cursor position before calling LCD_Printf().
/// @param lcd Pointer to the lcd_handle_t structure that contains the configuration
/// for the LCD interface. This structure must be properly initialized with the
/// correct interface mode, number of rows and columns, data port and control pin
/// configurations, and a buffer for storing the current display contents. The
/// function will use this information to send each character of the string to the
/// LCD as data, and it will also update the display buffer accordingly. The
/// function will continue to print characters until the end of the string is reached.
/// @param row The row number (1-based) where the formatted string should start
/// @param col The column number (1-based) where the formatted string should start
/// @param format The format string
/// @param ... Additional arguments for the format string
void LCD_PrintfAt(lcd_handle_t *lcd, uint8_t row, uint8_t col, const char *format, ...)
{
    char temp[LCD_PRINTF_FALLBACK_BUFFER_SIZE];
    char *dst;
    size_t dst_size;

    if (!checkIfInitialized(lcd))
    {
        return;
    }

    if ((lcd->buffer != NULL) && (lcd->buffer_size > 0U))
    {
        dst = (char *)lcd->buffer;
        dst_size = lcd->buffer_size;
    }
    else
    {
        dst = temp;
        dst_size = sizeof(temp);
    }

    va_list args;
    va_start(args, format);
    (void)vsnprintf(dst, dst_size, format, args);
    va_end(args);
    LCD_SetCursor(lcd, row, col); // Move cursor to the specified position
    LCD_Print(lcd, dst);          // Print the formatted string at the specified position
}

/// @brief  This self test exercises the LCD by performing a series of operations
/// that demonstrate basic functionality. It clears the display, moves the cursor
/// around, prints upper and lower case alphabets, symbols, and numbers.  It also
/// demonstrates some of the basic capabilities of the HD44780 controller by performing
/// display shifts, cursor movements, and other operations. It also
/// demonstrates the backlight control function by toggling the backlight on and
/// off during the test.
/// @param lcd Pointer to the lcd_handle_t structure that contains the configuration
/// for the LCD interface. This structure must be properly initialized with the
/// correct interface mode, number of rows and columns, data port and control pin
/// configurations, and a buffer for storing the current display contents. The
/// function will use this information to send each character of the string to the
/// LCD as data, and it will also update the display buffer accordingly. The
/// function will continue to print characters until the end of the string is reached.
/// @param  None
/// @return None
void LCD_SelfTest(lcd_handle_t *lcd)
{
    LCD_Clear(lcd);
    LCD_PrintAt(lcd, 1, 1, "LCD Self Test");
    LCD_SetCursor(lcd, 1, 1);
    for (uint8_t i = 1; i <= 20; i++)
    {
        LCD_SetCursor(lcd, 1, i); // Move cursor to column i of the first line
        __delay_ms(500);
        LCD_SetCursor(lcd, 2, 1); // Display the current column number on the second line
        LCD_PrintfAt(lcd, 2, 1, "Col: %d", i);
    }

    LCD_Clear(lcd);
    LCD_PrintAt(lcd, 1, 1, "LCD Self Test");
    LCD_PrintAt(lcd, 2, 1, "abcdefghijklmnopqrst");
    LCD_PrintAt(lcd, 3, 1, "uvwxyz");
    __delay_ms(2000);
    LCD_PrintAt(lcd, 2, 1, "ABCDEFGHIJKLMNOPQRST");
    LCD_PrintAt(lcd, 3, 1, "UCWXYZ");
    __delay_ms(2000);
    LCD_PrintAt(lcd, 2, 1, "12345678901234567890");
    LCD_PrintAt(lcd, 3, 1, "!@#$%^&*()_+-=~`");
    __delay_ms(2000);
    LCD_Clear(lcd);
    LCD_PrintAt(lcd, 1, 1, "LCD Self Test");
    LCD_BackLight(lcd, false); // Turn off backlight
    __delay_ms(2000);
    LCD_BackLight(lcd, true); // Turn on backlight
    LCD_PrintAt(lcd, 2, 1, "Left");
    const char *centered = "Centered";
    const char *right = "Right";
    uint8_t centered_col = (uint8_t)(((20 - strlen(centered)) / 2) + 1);
    uint8_t right_col = (uint8_t)(20 - strlen(right) + 1);
    LCD_PrintAt(lcd, 3, centered_col, centered);
    LCD_PrintAt(lcd, 4, right_col, right);
    __delay_ms(2000);

    // Clear  the display and print a message at the end of line 4, then shift the
    // display left 10 characters, which will cause the message to scroll across
    // the display from right to left.
    LCD_Clear(lcd);
    LCD_PrintAt(lcd, 4, 14, "Scroll");
    for (int i = 0; i < 10; i++)
    {
        LCD_SendCommand(lcd, LCD_CMD_CURSOR_SHIFT | LCD_DISPLAY_MOVE | LCD_MOVE_LEFT);
        __delay_ms(500);
    }
    __delay_ms(2000);

    // Now shift the display back to the right to return it to the original position
    for (int i = 0; i < 10; i++)
    {
        LCD_SendCommand(lcd, LCD_CMD_CURSOR_SHIFT | LCD_DISPLAY_MOVE | LCD_MOVE_RIGHT);
        __delay_ms(500);
    }
    __delay_ms(2000);

    // Clear the display and now lets print every character in the LCD character
    // set by writing the character codes directly to the display as data bytes,
    // 80 bytes at a time, with a 1 second delay between each batch.  This will
    // demonstrate the full character set of the LCD, including the custom
    // characters that can be created in CGRAM, which are typically mapped to
    // character codes 0-7.
    LCD_Clear(lcd);
    uint8_t line = 1;
    int code = 0;
    while (code < 256)
    {
        for (line = 1; line <= 4; line++)
        {
            LCD_SetCursor(lcd, line, 1); // Move cursor to the beginning of the current line
            for (uint8_t col = 1; col <= 20 && code < 256; col++, code++)
            {
                LCD_SendData(lcd, (uint8_t)code & 0xFF); // Send the character code as a data byte to display it
            }
        }
        __delay_ms(1000); // Delay after every 20 characters (one line)
        LCD_Clear(lcd);
    }
}
